In [86]:
import pandas as pd
import numpy as np
import seaborn as sns
import random as rd
import matplotlib.pyplot as plt
from datetime import datetime as dt

In [69]:
data = pd.read_csv("booking_train_set.csv", index_col=0)
data.shape

(1166835, 9)

In [70]:
data.head()

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id
0,1006220,2016-04-09,2016-04-11,31114,desktop,384,Gondal,Gondal,1006220_1
1,1006220,2016-04-11,2016-04-12,39641,desktop,384,Gondal,Gondal,1006220_1
2,1006220,2016-04-12,2016-04-16,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1
3,1006220,2016-04-16,2016-04-17,24144,desktop,384,Gondal,Gondal,1006220_1
4,1010293,2016-07-09,2016-07-10,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1

In [71]:
#print ('Current date/time: {}'.format(dt.now()))
checkin = pd.to_datetime(data['checkin'],format='%Y-%m-%d')
checkout = pd.to_datetime(data['checkout'],format='%Y-%m-%d')

data['duration'] = checkout - checkin
#data['month'] = pd.to_datetime(data['checkout'],format='%m')
#data['year'] = pd.to_datetime(data['checkout'],format='%Y')

data.head(10)

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,1006220,2016-04-09,2016-04-11,31114,desktop,384,Gondal,Gondal,1006220_1,2 days
1,1006220,2016-04-11,2016-04-12,39641,desktop,384,Gondal,Gondal,1006220_1,1 days
2,1006220,2016-04-12,2016-04-16,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1,4 days
3,1006220,2016-04-16,2016-04-17,24144,desktop,384,Gondal,Gondal,1006220_1,1 days
4,1010293,2016-07-09,2016-07-10,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
5,1010293,2016-07-10,2016-07-11,55,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
6,1010293,2016-07-12,2016-07-13,23921,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
7,1010293,2016-07-13,2016-07-15,65322,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1,2 days
8,1010293,2016-07-15,2016-07-16,23921,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1,1 days
9,1010293,2016-07-16,2016-07-17,20545,desktop,10573,The Devilfire Empire,Cobra Island,1010293_1,1 days

In [72]:
#data['duration'].describe()
data['duration'] = data['duration'].dt.days
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1166835 entries, 0 to 1166834
Data columns (total 10 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   user_id         1166835 non-null  int64
 1   checkin         1166835 non-null  object
 2   checkout        1166835 non-null  object
 3   city_id         1166835 non-null  int64
 4   device_class    1166835 non-null  object
 5   affiliate_id    1166835 non-null  int64
 6   booker_country  1166835 non-null  object
 7   hotel_country   1166835 non-null  object
 8   utrip_id        1166835 non-null  object
 9   duration        1166835 non-null  int64
dtypes: int64(4), object(6)
memory usage: 97.9+ MB

In [73]:
df = data
del df['user_id']
del df['checkout']
df.head()

,checkin,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,2016-04-09,31114,desktop,384,Gondal,Gondal,1006220_1,2
1,2016-04-11,39641,desktop,384,Gondal,Gondal,1006220_1,1
2,2016-04-12,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1,4
3,2016-04-16,24144,desktop,384,Gondal,Gondal,1006220_1,1
4,2016-07-09,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1

In [78]:
##Checking for nulls
df[df.isnull().any(axis=1)]   #none

Empty DataFrame
Columns: [checkin, city_id, device_class, affiliate_id, booker_country, hotel_country, utrip_id, duration]
Index: []

In [79]:
df['device_class'] = df['device_class'].astype('category')
df["booker_country"] = df['booker_country'].astype('category')
df['hotel_country'] = df['hotel_country'].astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1166835 entries, 0 to 1166834
Data columns (total 8 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   checkin         1166835 non-null  object
 1   city_id         1166835 non-null  int64
 2   device_class    1166835 non-null  category
 3   affiliate_id    1166835 non-null  int64
 4   booker_country  1166835 non-null  category
 5   hotel_country   1166835 non-null  category
 6   utrip_id        1166835 non-null  object
 7   duration        1166835 non-null  int64
dtypes: category(3), int64(3), object(2)
memory usage: 57.9+ MB

In [80]:
df['device_class'] = df['device_class'].cat.codes
df["booker_country"] = df['booker_country'].cat.codes
df['hotel_country'] = df['hotel_country'].cat.codes
df.head()

,checkin,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,2016-04-09,31114,0,384,2,60,1006220_1,2
1,2016-04-11,39641,0,384,2,60,1006220_1,1
2,2016-04-12,20232,0,384,2,59,1006220_1,4
3,2016-04-16,24144,0,384,2,60,1006220_1,1
4,2016-07-09,5325,1,359,4,36,1010293_1,1

In [81]:
df['utrip_id'] = df['utrip_id'].astype('category')
df['utrip_id'] = df['utrip_id'].cat.codes
df.head()

,checkin,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,2016-04-09,31114,0,384,2,60,248,2
1,2016-04-11,39641,0,384,2,60,248,1
2,2016-04-12,20232,0,384,2,59,248,4
3,2016-04-16,24144,0,384,2,60,248,1
4,2016-07-09,5325,1,359,4,36,410,1

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1166835 entries, 0 to 1166834
Data columns (total 8 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   checkin         1166835 non-null  object
 1   city_id         1166835 non-null  int64
 2   device_class    1166835 non-null  int8
 3   affiliate_id    1166835 non-null  int64
 4   booker_country  1166835 non-null  int8
 5   hotel_country   1166835 non-null  int16
 6   utrip_id        1166835 non-null  int32
 7   duration        1166835 non-null  int64
dtypes: int16(1), int32(1), int64(3), int8(2), object(1)
memory usage: 53.4+ MB

In [83]:
#Spring 1, Summer 2, Autumn 3, Winter 4
[month%12 // 3 + 1 for month in range(1, 13)]

[1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 1]

In [84]:
df['checkin'] = pd.to_datetime(df['checkin'],format='%Y-%m-%d')
df['checkin'] = df['checkin'].dt.month%12 // 3 + 1
df.head()

,checkin,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,2,31114,0,384,2,60,248,2
1,2,39641,0,384,2,60,248,1
2,2,20232,0,384,2,59,248,4
3,2,24144,0,384,2,60,248,1
4,3,5325,1,359,4,36,410,1

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1166835 entries, 0 to 1166834
Data columns (total 8 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   checkin         1166835 non-null  int64
 1   city_id         1166835 non-null  int64
 2   device_class    1166835 non-null  int8
 3   affiliate_id    1166835 non-null  int64
 4   booker_country  1166835 non-null  int8
 5   hotel_country   1166835 non-null  int16
 6   utrip_id        1166835 non-null  int32
 7   duration        1166835 non-null  int64
dtypes: int16(1), int32(1), int64(4), int8(2)
memory usage: 53.4 MB